{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "input_dtype": "int32", "name": "embedding_7", "activity_regularizer": null, "batch_input_shape": [null, 65], "init": "uniform", "input_length": 65, "output_dim": 100, "dropout": 0.0, "input_dim": 1193515, "W_regularizer": null, "W_constraint": null, "mask_zero": false}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_7", "trainable": true, "layer": {"class_name": "LSTM", "config": {"consume_less": "cpu", "go_backwards": false, "trainable": true, "dropout_W": 0.0, "forget_bias_init": "one", "input_length": null, "name": "forward_lstm_7", "unroll": false, "inner_init": "orthogonal", "init": "glorot_uniform", "activation": "tanh", "stateful": false, "output_dim": 100, "return_sequences": false, "b_regularizer": null, "input_dim": 100, "W_regularizer": null, "dropout_U": 0.0, "inner_activation": "hard_sigmoid", "U_regularizer": null}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_17", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "activation": "linear", "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "input_dim": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_18", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 25, "activation": "linear", "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "input_dim": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_19", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 4, "activation": "softsign", "b_regularizer": null, "input_dim": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true}}]}