{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 65], "activity_regularizer": null, "input_dtype": "int32", "W_constraint": null, "dropout": 0.0, "init": "uniform", "W_regularizer": null, "name": "embedding_35", "output_dim": 100, "mask_zero": false, "input_dim": 1193515, "trainable": true, "input_length": 65}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional_32", "trainable": true, "layer": {"class_name": "LSTM", "config": {"unroll": false, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "return_sequences": false, "dropout_W": 0.0, "activation": "tanh", "dropout_U": 0.0, "go_backwards": false, "init": "glorot_uniform", "consume_less": "cpu", "stateful": false, "name": "forward_lstm_32", "b_regularizer": null, "U_regularizer": null, "forget_bias_init": "one", "input_length": null, "input_dim": 100, "output_dim": 100, "trainable": true, "W_regularizer": null}}}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_32", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_93", "b_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "output_dim": 50, "input_dim": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_94", "b_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "output_dim": 25, "input_dim": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "activation": "softmax", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_95", "b_regularizer": null, "output_dim": 6, "input_dim": null, "trainable": true, "b_constraint": null}}]}