{"config": [{"config": {"batch_input_shape": [null, 55], "name": "embedding_7", "input_length": 55, "output_dim": 100, "init": "uniform", "input_dtype": "int32", "W_regularizer": null, "input_dim": 1193515, "dropout": 0.0, "W_constraint": null, "activity_regularizer": null, "trainable": true, "mask_zero": false}, "class_name": "Embedding"}, {"config": {"name": "bidirectional_7", "trainable": true, "merge_mode": "concat", "layer": {"config": {"trainable": true, "name": "forward_lstm_7", "input_length": null, "go_backwards": false, "return_sequences": false, "unroll": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "consume_less": "cpu", "b_regularizer": null, "output_dim": 100, "W_regularizer": null, "input_dim": 100, "dropout_U": 0.0, "forget_bias_init": "one", "inner_init": "orthogonal", "stateful": false, "U_regularizer": null, "activation": "tanh", "dropout_W": 0.0}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"p": 0.2, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"output_dim": 50, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "W_regularizer": null, "input_dim": null, "name": "dense_19", "W_constraint": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"output_dim": 25, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "W_regularizer": null, "input_dim": null, "name": "dense_20", "W_constraint": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"output_dim": 1, "bias": true, "activation": "softsign", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "name": "dense_21", "W_constraint": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.0"}