{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"dropout": 0.0, "trainable": true, "W_regularizer": null, "init": "uniform", "output_dim": 100, "activity_regularizer": null, "input_dim": 1193515, "batch_input_shape": [null, 65], "mask_zero": false, "input_length": 65, "input_dtype": "int32", "W_constraint": null, "name": "embedding_1"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"activation": "tanh", "trainable": true, "inner_activation": "hard_sigmoid", "unroll": false, "stateful": false, "init": "glorot_uniform", "output_dim": 100, "return_sequences": false, "U_regularizer": null, "input_dim": 100, "dropout_U": 0.0, "input_length": null, "consume_less": "cpu", "forget_bias_init": "one", "go_backwards": false, "inner_init": "orthogonal", "dropout_W": 0.0, "b_regularizer": null, "name": "forward_lstm_1", "W_regularizer": null}}, "trainable": true, "name": "bidirectional_1", "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "init": "glorot_uniform", "output_dim": 50, "activity_regularizer": null, "bias": true, "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "name": "dense_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "init": "glorot_uniform", "output_dim": 25, "activity_regularizer": null, "bias": true, "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": {"l2": 0.009999999776482582, "name": "WeightRegularizer", "l1": 0.0}, "name": "dense_2"}}, {"class_name": "Dense", "config": {"activation": "softsign", "trainable": true, "init": "glorot_uniform", "output_dim": 1, "activity_regularizer": null, "bias": true, "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "name": "dense_3"}}]}