{"keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_11", "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 55], "input_length": 55, "dropout": 0.0, "W_constraint": null, "output_dim": 100, "mask_zero": false, "input_dtype": "int32", "input_dim": 1193515, "init": "uniform"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_11", "layer": {"class_name": "LSTM", "config": {"trainable": true, "name": "forward_lstm_11", "stateful": false, "dropout_W": 0.0, "consume_less": "cpu", "input_length": null, "U_regularizer": null, "go_backwards": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "dropout_U": 0.0, "return_sequences": false, "inner_init": "orthogonal", "unroll": false, "input_dim": 100, "forget_bias_init": "one", "init": "glorot_uniform", "activation": "tanh", "inner_activation": "hard_sigmoid"}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_11", "p": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_31", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "W_constraint": null, "bias": true, "output_dim": 50, "input_dim": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_32", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "W_constraint": null, "bias": true, "output_dim": 25, "input_dim": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_33", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "output_dim": 1, "input_dim": null, "init": "glorot_uniform", "activation": "softsign"}}], "class_name": "Sequential"}