{"config": [{"config": {"init": "uniform", "batch_input_shape": [null, 65], "trainable": true, "W_constraint": null, "dropout": 0.0, "output_dim": 100, "input_length": 65, "input_dtype": "int32", "activity_regularizer": null, "mask_zero": false, "input_dim": 1193515, "W_regularizer": null, "name": "embedding_4"}, "class_name": "Embedding"}, {"config": {"trainable": true, "layer": {"config": {"inner_activation": "hard_sigmoid", "forget_bias_init": "one", "activation": "tanh", "b_regularizer": null, "return_sequences": false, "trainable": true, "stateful": false, "go_backwards": false, "output_dim": 100, "unroll": false, "input_length": null, "dropout_W": 0.0, "inner_init": "orthogonal", "consume_less": "cpu", "input_dim": 100, "dropout_U": 0.0, "init": "glorot_uniform", "U_regularizer": null, "name": "forward_lstm_4", "W_regularizer": null}, "class_name": "LSTM"}, "name": "bidirectional_4", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "trainable": true, "W_constraint": null, "output_dim": 50, "W_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_10"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "WeightRegularizer"}, "trainable": true, "W_constraint": null, "output_dim": 25, "W_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_11"}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activity_regularizer": null, "activation": "softsign", "b_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 1, "W_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_12"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.0"}