{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 65], "activity_regularizer": null, "W_regularizer": null, "input_length": 65, "name": "embedding_2", "init": "uniform", "dropout": 0.0, "input_dim": 1193515, "W_constraint": null, "input_dtype": "int32", "output_dim": 100, "trainable": true, "mask_zero": false}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "layer": {"class_name": "LSTM", "config": {"W_regularizer": null, "input_length": null, "inner_activation": "hard_sigmoid", "activation": "tanh", "consume_less": "cpu", "unroll": false, "stateful": false, "init": "glorot_uniform", "input_dim": 100, "name": "forward_lstm_2", "go_backwards": false, "dropout_W": 0.0, "b_regularizer": null, "return_sequences": false, "output_dim": 100, "inner_init": "orthogonal", "trainable": true, "dropout_U": 0.0, "U_regularizer": null, "forget_bias_init": "one"}}, "merge_mode": "concat", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "linear", "bias": true, "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "output_dim": 50, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "linear", "bias": true, "b_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "output_dim": 25, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_6", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softsign", "bias": true, "b_regularizer": null, "output_dim": 1, "trainable": true}}]}